In [1]:
import pandas
mydataset = { 'cars': ["BMW", "Volvo", "Ford","BharatBenz","TataNexon","MahindraScorpio","Alto800"], 
             'passings': [3, 7, 2, 9, 4, 6,5]}
myvar = pandas.DataFrame(mydataset)
print(myvar)

              cars  passings
0              BMW         3
1            Volvo         7
2             Ford         2
3       BharatBenz         9
4        TataNexon         4
5  MahindraScorpio         6
6          Alto800         5

In [2]:
import pandas
mydataset ={'Coaching': ['NEET','JEE','MHT-CET','Foundation','KVPY','Olympiad'],'Fees':[5000,7000,7500,4000,3000,2000]}
myvar=pandas.DataFrame(mydataset)
print(myvar)

     Coaching  Fees
0        NEET  5000
1         JEE  7000
2     MHT-CET  7500
3  Foundation  4000
4        KVPY  3000
5    Olympiad  2000

In [3]:
import pandas as pd
print(pd.__version__)

1.4.2

!pip install pandas

In [4]:
import pandas as pd
print(pd.__version__)

1.4.2

In [5]:
import pandas as pd 
import numpy as np
np.arange(0,20).reshape(5,4)
df=pd.DataFrame(data=np.arange(0,20).reshape(5,4),index=['Row1','Row2','Row3'
                                                      ,'Row4','Row5'],
                                                  columns=['column1','column2','column3','column4'])
print('Fisrt top 10 records \n',df.head())
print('Last 10 records \n',df.tail())
print(type(df))

Fisrt top 10 records
       column1  column2  column3  column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19
Last 10 records
       column1  column2  column3  column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19
<class 'pandas.core.frame.DataFrame'>

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, Row1 to Row5
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   column1  5 non-null      int32
 1   column2  5 non-null      int32
 2   column3  5 non-null      int32
 3   column4  5 non-null      int32
dtypes: int32(4)
memory usage: 120.0+ bytes

In [7]:
df.describe()

         column1    column2    column3    column4
count   5.000000   5.000000   5.000000   5.000000
mean    8.000000   9.000000  10.000000  11.000000
std     6.324555   6.324555   6.324555   6.324555
min     0.000000   1.000000   2.000000   3.000000
25%     4.000000   5.000000   6.000000   7.000000
50%     8.000000   9.000000  10.000000  11.000000
75%    12.000000  13.000000  14.000000  15.000000
max    16.000000  17.000000  18.000000  19.000000

In [8]:
df.head()

      column1  column2  column3  column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [9]:
df[['column1','column2','column3']]

      column1  column2  column3
Row1        0        1        2
Row2        4        5        6
Row3        8        9       10
Row4       12       13       14
Row5       16       17       18

In [10]:
type(df)

pandas.core.frame.DataFrame

In [11]:
type(df['column1'])

pandas.core.series.Series

In [12]:
df.loc[['Row3','Row4']]

      column1  column2  column3  column4
Row3        8        9       10       11
Row4       12       13       14       15

In [13]:
type(df.loc[['Row3','Row4']])

pandas.core.frame.DataFrame

In [14]:
type(df.loc['Row3'])

pandas.core.series.Series

In [15]:
df.head()

      column1  column2  column3  column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [16]:
df.iloc[2:4,0:2]

      column1  column2
Row3        8        9
Row4       12       13

In [17]:
df.iloc[0:,0:-3]

      column1
Row1        0
Row2        4
Row3        8
Row4       12
Row5       16

In [18]:
df.iloc[:,1:].values

array([[ 1,  2,  3],
       [ 5,  6,  7],
       [ 9, 10, 11],
       [13, 14, 15],
       [17, 18, 19]])

In [19]:
df

      column1  column2  column3  column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [20]:
df=pd.DataFrame(data=[[1,np.nan,2],[1,4,7],[np.nan,3,-1]],index=['Row1','Row2','Row3'],
                                                        columns=['column1','column2','column3'])

In [21]:
df

      column1  column2  column3
Row1      1.0      NaN        2
Row2      1.0      4.0        7
Row3      NaN      3.0       -1

In [22]:
df.isnull()

      column1  column2  column3
Row1    False     True    False
Row2    False    False    False
Row3     True    False    False

In [23]:
df.isnull().sum()

column1    1
column2    1
column3    0
dtype: int64

In [24]:
df[~df.isnull()]

      column1  column2  column3
Row1      1.0      NaN        2
Row2      1.0      4.0        7
Row3      NaN      3.0       -1

In [25]:
df.isnull().sum()==0

column1    False
column2    False
column3     True
dtype: bool

In [26]:
df['column3'].value_counts()

 2    1
 7    1
-1    1
Name: column3, dtype: int64

In [27]:
df['column2'].unique()

array([nan,  4.,  3.])

In [28]:
df[df['column2']>2]

      column1  column2  column3
Row2      1.0      4.0        7
Row3      NaN      3.0       -1

In [29]:
df

      column1  column2  column3
Row1      1.0      NaN        2
Row2      1.0      4.0        7
Row3      NaN      3.0       -1

In [30]:
import pandas as pd
a = [71, 27, 26]
myvar = pd.Series(a)
print(myvar)

0    71
1    27
2    26
dtype: int64

In [31]:
import pandas as pd
a = [10, 15, 20]
myvar = pd.Series(a, index = ["x", "y", "z"])
print(myvar)

x    10
y    15
z    20
dtype: int64

In [32]:
import pandas as pd
calories = {"day1": 420, "day2": 380, "day3": 390}
myvar = pd.Series(calories)
print(myvar)

day1    420
day2    380
day3    390
dtype: int64

In [33]:
import numpy as np
import pandas as pd
dict1={'name':['rohan','sandip','yogi','ravi','sunil'],
      'city':['tasgaon','vadgaon','sangli','kolhapur','baramati'],
      'marks':[90, 87, 75, 65, 74] 
     }

In [34]:
df=pd.DataFrame(dict1)

In [35]:
df

     name      city  marks
0   rohan   tasgaon     90
1  sandip   vadgaon     87
2    yogi    sangli     75
3    ravi  kolhapur     65
4   sunil  baramati     74

In [36]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [37]:
df.head()

     name      city  marks
0   rohan   tasgaon     90
1  sandip   vadgaon     87
2    yogi    sangli     75
3    ravi  kolhapur     65
4   sunil  baramati     74

In [38]:
df.to_csv('friend.csv')

In [39]:
df.to_csv('friend123.csv',index=False)

In [40]:
df.head(2)

     name     city  marks
0   rohan  tasgaon     90
1  sandip  vadgaon     87

In [41]:
df.tail(3)

    name      city  marks
2   yogi    sangli     75
3   ravi  kolhapur     65
4  sunil  baramati     74

In [42]:
df.describe()

           marks
count   5.000000
mean   78.200000
std    10.232302
min    65.000000
25%    74.000000
50%    75.000000
75%    87.000000
max    90.000000

In [43]:
t=pd.read_csv('friend.csv')

In [44]:
t

   Unnamed: 0    name      city  marks
0           0   rohan   tasgaon     90
1           1  sandip   vadgaon     87
2           2    yogi    sangli     75
3           3    ravi  kolhapur     65
4           4   sunil  baramati     74

In [45]:
m=pd.read_csv('friend123.csv')

In [46]:
m

     name      city  marks
0   rohan   tasgaon     90
1  sandip   vadgaon     87
2    yogi    sangli     75
3    ravi  kolhapur     65
4   sunil  baramati     74

In [47]:
k=pd.read_csv('train.csv')

In [48]:
k

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [49]:
type(k)

pandas.core.frame.DataFrame

In [50]:
k.iloc[:,2:]

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...
886,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q